; domain
(define (domain depot)
(:predicates
	 (at ?x ?y) (on ?x ?y) (in ?x ?y) (lifting ?x ?y) (available ?x) (clear ?x)(place ?x) (locatable ?x) (depot ?x) (distributor ?x) (truck ?x) (hoist ?x) (surface ?x) (pallet ?x) (crate ?x) )
(:action drive
 :parameters ( ?x ?y ?z)
 :precondition
	(and (truck ?x) (place ?y) (place ?z)  (at ?x ?y))
 :effect
	(and (at ?x ?z) (not (at ?x ?y))))

(:action lift
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (surface ?z) (place ?p)  (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
 :effect
	(and (lifting ?x ?y) (clear ?z) (not (at ?y ?p)) (not (clear ?y)) (not (available ?x)) (not (on ?y ?z))))

(:action drop
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (surface ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
 :effect
	(and (available ?x) (at ?y ?p) (clear ?y) (on ?y ?z) (not (lifting ?x ?y)) (not (clear ?z))))

(:action load
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (truck ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
 :effect
	(and (in ?y ?z) (available ?x) (not (lifting ?x ?y))))

(:action unload
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (truck ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
 :effect
	(and (lifting ?x ?y) (not (in ?y ?z)) (not (available ?x))))

)

; problem
(define (problem depotprob1935) (:domain Depot)
(:objects
	depot0 distributor0 distributor1 truck0 truck1 pallet0 pallet1 pallet2 crate0 crate1 crate2 crate3 crate4 crate5 hoist0 hoist1 hoist2 )
(:init
	(pallet pallet0)
	(surface pallet0)
	(at pallet0 depot0)
	(clear crate1)
	(pallet pallet1)
	(surface pallet1)
	(at pallet1 distributor0)
	(clear crate4)
	(pallet pallet2)
	(surface pallet2)
	(at pallet2 distributor1)
	(clear crate5)
	(truck truck0)
	(at truck0 depot0)
	(truck truck1)
	(at truck1 distributor0)
	(hoist hoist0)
	(at hoist0 depot0)
	(available hoist0)
	(hoist hoist1)
	(at hoist1 distributor0)
	(available hoist1)
	(hoist hoist2)
	(at hoist2 distributor1)
	(available hoist2)
	(crate crate0)
	(surface crate0)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(crate crate1)
	(surface crate1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(crate crate2)
	(surface crate2)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(crate crate3)
	(surface crate3)
	(at crate3 distributor0)
	(on crate3 crate0)
	(crate crate4)
	(surface crate4)
	(at crate4 distributor0)
	(on crate4 crate3)
	(crate crate5)
	(surface crate5)
	(at crate5 distributor1)
	(on crate5 crate2)
	(place depot0)
	(place distributor0)
	(place distributor1)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet2)
		(on crate2 pallet0)
		(on crate3 crate2)
		(on crate4 pallet1)
		(on crate5 crate0)
	)
))

; plan
1. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 0 of 6
2. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   goals met: 0 of 6
3. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 0 of 6
4. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   goals met: 0 of 6
5. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   goals met: 0 of 6
6. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   goals met: 0 of 6
7. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 0 of 6
8. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 0 of 6
9. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 0 of 6
10. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 1 of 6
11. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 1 of 6
12. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 2 of 6
13. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 2 of 6
14. (lift hoist1 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 2 of 6
15. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 2 of 6
16. (lift hoist1 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate0)
   added: (lifting hoist1 crate3) (clear crate0)
   goals met: 2 of 6
17. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 2 of 6
18. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 6
19. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 2 of 6
20. (drop hoist0 crate3 crate2 depot0)
   deleted: (lifting hoist0 crate3) (clear crate2)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate2)
   goals met: 3 of 6
21. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 3 of 6
22. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 3 of 6
23. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 3 of 6
24. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 3 of 6
25. (drop hoist2 crate0 crate1 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate1)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate1)
   goals met: 4 of 6
26. (unload hoist2 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 4 of 6
27. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 4 of 6
28. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 4 of 6
29. (drop hoist1 crate4 pallet1 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 pallet1)
   goals met: 5 of 6
30. (drop hoist2 crate5 crate0 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate0)
   added: (available hoist2) (at crate5 distributor1) (clear crate5) (on crate5 crate0)
   goals met: 6 of 6
